# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3
import pandas as pd
conn=sqlite3.connect("data.sqlite")
cursor=conn.cursor()

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [4]:
#Your code here; use a subquery. No join will be necessary.
query1='''select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       where customernumber in (select customernumber from orders
       where orderDate = '2003-01-31')'''
pd.read_sql_query(query1,conn)

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [30]:
#Your code here
query2= '''select productcode, productname, order_sum from products
join (select productcode, sum(quantityordered) as order_sum
from orderdetails group by productcode) using(productcode)
order by order_sum asc'''
pd.read_sql_query(query2,conn).head(2)

  productCode                 productName  order_sum
0    S18_4933       1957 Ford Thunderbird        767
1    S24_1046  1970 Chevy Chevelle SS 454        803

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [29]:
#Your code here
query3= '''select productname, count(distinct customernumber) as count from products
join (select productcode, ordernumber,customernumber from orderdetails join
(select ordernumber, customernumber from orders) using(ordernumber)) using(productcode)
group by productcode order by count desc'''
pd.read_sql_query(query3,conn).head(2)

                   productName  count
0  1992 Ferrari 360 Spider red     40
1     1952 Alpine Renault 1300     27

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here
query4='''select employeenumber, officecode, city, firstname, lastname
from employees E, office O, 
(select count customer_number from employees E1, customers C, orders OO 
where E1.employeenumber= C.salesrepemloyeenumber
AND OO.customernumber=C.customernumber) 

where E.officecode=O.officecode AND where
'''

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!